clojure-101/clojure101.org
#+OPTIONS: toc:nil num:nil timestamp:nil
#+OPTIONS: reveal_width:1080
#+OPTIONS: reveal_height:768
#+TITLE: Clojure (& Clojurescript) 101
#+AUTHOR: Chris Howe-Jones
#+EMAIL: @agile_geek
#+DATE:  26th April 2018
#+REVEAL_SLIDE_NUMBER: false
#+REVEAL_MARGIN: 0.1

#+OPTIONS: reveal_center:t
#+OPTIONS: reveal_rolling_links:t reveal_overview:t
#+REVEAL_KEYBOARD:t
#+REVEAL_THEME: league
#+REVEAL_TRANS: concave
#+REVEAL_HLEVEL: 2
#+REVEAL_CENTER: true
#+REVEAL_ROOT: file:///home/chris/reveal.js
#+REVEAL_PLUGINS: (highlight markdown notes)
#+REVEAL_SLIDE_FOOTER: @agile_geek
#+REVEAL_EXTRA_CSS: footer.css
* Clojure 101

  ... and Clojurescript

* Who am I?

  Name:      =Chris Howe-Jones= *[Technical Navigator]*

  Twitter:   =@agile_geek=

  Github:    =http://github.com/chrishowejones=

  LinkedIn:  =https://uk.linkedin.com/in/chrishowejones=

  Organiser: =London Clojurians, Clojure eXchange, ClojureBridge=

  Speaker:   =FP North East, Agile North East, London Clojurians,
  Dynamo Conference, West Midlands JUG, DefShef, Sunderland Uni=

* What is Clojure?

  It's a 'Lisp' that's hosted on various platforms.

  - JVM
  - Javascript (transpiled with full source map)
  - CLR

* Simple Syntax

  Everything in (parens) is a list...

  #+ATTR_REVEAL: :frag (roll-in)
  - The first item in a list is a /function/.
  #+ATTR_REVEAL: :frag (roll-in)
  - The first /item/ in a list is a function.
  #+ATTR_REVEAL: :frag (roll-in)
  - The /first/ item in a list is a function.

* More syntax...

  #+ATTR_REVEAL: :frag (roll-in)
  - And we are done!

* Demo time...

  =Show me the code=
