clojure-101/clojure101.tex
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Chris Howe-Jones}
\date{20th Dec 2017}
\title{Clojure (\& Clojurescript) 101}
\hypersetup{
 pdfauthor={Chris Howe-Jones},
 pdftitle={Clojure (\& Clojurescript) 101},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.2 (Org mode 9.1.2)},
 pdflang={English}}
\begin{document}

\maketitle
\section*{Clojure 101}
\label{sec:org84a5db0}

\ldots{} and Clojurescript

\section*{Who am I?}
\label{sec:org8e36379}

Name:      \texttt{Chris Howe-Jones} \textbf{[Technical Navigator]}

Twitter:   \texttt{@agile\_geek}

Github:    \texttt{http://github.com/chrishowejones}

LinkedIn:  \texttt{https://uk.linkedin.com/in/chrishowejones}

Organiser: \texttt{London Clojurians, Clojure eXchange, ClojureBridge}

Speaker:   \texttt{FP North East, Agile North East, London Clojurians,
  Dynamo Conference, West Midlands JUG, DefShef, Sunderland Uni}

\section*{What is Clojure?}
\label{sec:org24ec665}

It's a 'Lisp' that's hosted on various platforms.

\begin{itemize}
\item JVM
\item Javascript (transpiled with full source map)
\item CLR
\end{itemize}

\section*{Simple Syntax}
\label{sec:orgf97ff2e}

Everything in (parens) is a list\ldots{}

\begin{itemize}
\item The first item in a list is a \emph{function}.
\end{itemize}
\begin{itemize}
\item The first \emph{item} in a list is a function.
\end{itemize}
\begin{itemize}
\item The \emph{first} item in a list is a function.
\end{itemize}

\section*{More syntax\ldots{}}
\label{sec:org709d700}

\begin{itemize}
\item And we are done!
\end{itemize}

\section*{Demo time\ldots{}}
\label{sec:org22988ab}

\texttt{Show me the code}
\end{document}
